1. Load the tb.csv file into a Panda's data frame and print out the column names.

In [26]:
import pandas as pd

In [27]:
data=pd.read_csv('tb.csv')
data

,country,year,m04,m514,m014,m1524,m2534,m3544,m4554,m5564,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5764,ZW,2004,NaN,NaN,187.0,833.0,2908.0,2298.0,1056.0,366.0,...,NaN,NaN,225.0,1140.0,2858.0,1565.0,622.0,214.0,111.0,NaN
5765,ZW,2005,NaN,NaN,210.0,837.0,2264.0,1855.0,762.0,295.0,...,NaN,NaN,269.0,1136.0,2242.0,1255.0,578.0,193.0,603.0,NaN
5766,ZW,2006,NaN,NaN,215.0,736.0,2391.0,1939.0,896.0,348.0,...,NaN,NaN,237.0,1020.0,2424.0,1355.0,632.0,230.0,96.0,NaN
5767,ZW,2007,6.0,132.0,138.0,500.0,3693.0,0.0,716.0,292.0,...,7.0,178.0,185.0,739.0,3311.0,0.0,553.0,213.0,90.0,NaN
5768,ZW,2008,NaN,NaN,127.0,614.0,0.0,3316.0,704.0,263.0,...,NaN,NaN,145.0,840.0,0.0,2890.0,467.0,174.0,105.0,0.0

2. Apply the Panda's melt operaton. (new columns: sexage, cases)

In [28]:
# 2. Apply the Panda's melt operaton. (new columns: sexage, cases)
data_melt=data.melt(data.columns[0:2],data.columns[2:,],'sexage','cases')
data_melt

       country  year sexage  cases
0           AD  1989    m04    NaN
1           AD  1990    m04    NaN
2           AD  1991    m04    NaN
3           AD  1992    m04    NaN
4           AD  1993    m04    NaN
...        ...   ...    ...    ...
115375      ZW  2004     fu    NaN
115376      ZW  2005     fu    NaN
115377      ZW  2006     fu    NaN
115378      ZW  2007     fu    NaN
115379      ZW  2008     fu    0.0

[115380 rows x 4 columns]

3. Separate the combined sexage column into two (sex, age), using lambda.

In [29]:
data_melt['sex'] = data_melt['sexage'].apply(lambda x: x[0])      # ký tự đầu
data_melt['age'] = data_melt['sexage'].apply(lambda x: x[1:])     # phần còn lại
data_melt

       country  year sexage  cases sex age
0           AD  1989    m04    NaN   m  04
1           AD  1990    m04    NaN   m  04
2           AD  1991    m04    NaN   m  04
3           AD  1992    m04    NaN   m  04
4           AD  1993    m04    NaN   m  04
...        ...   ...    ...    ...  ..  ..
115375      ZW  2004     fu    NaN   f   u
115376      ZW  2005     fu    NaN   f   u
115377      ZW  2006     fu    NaN   f   u
115378      ZW  2007     fu    NaN   f   u
115379      ZW  2008     fu    0.0   f   u

[115380 rows x 6 columns]

4. Rename the age range values, using Panda's map method. ('04'->'0-4', '514'-> '5-14', ...)

In [30]:
# 4. Rename the age range values, using Panda's map method. ('04'->'0-4', '514'-> '5-14', ...)
age_map = {
    '04': '0-4',
    '514': '5-14',
    '1524': '15-24',
    '2534': '25-34',
    '3544': '35-44',
    '4554': '45-54',
    '5564': '55-64',
    '65plus': '65+',
    'u': 'unknown'
}
data_melt['age'] = data_melt['age'].map(age_map)
data_melt

       country  year sexage  cases sex      age
0           AD  1989    m04    NaN   m      0-4
1           AD  1990    m04    NaN   m      0-4
2           AD  1991    m04    NaN   m      0-4
3           AD  1992    m04    NaN   m      0-4
4           AD  1993    m04    NaN   m      0-4
...        ...   ...    ...    ...  ..      ...
115375      ZW  2004     fu    NaN   f  unknown
115376      ZW  2005     fu    NaN   f  unknown
115377      ZW  2006     fu    NaN   f  unknown
115378      ZW  2007     fu    NaN   f  unknown
115379      ZW  2008     fu    0.0   f  unknown

[115380 rows x 6 columns]

5. Drop all the unknown values in the column cases, using dropna (with subset=[columns]).

In [31]:
# 5. Drop all the unknown values in the column cases, using dropna (with subset=[columns]).
data_cleaned = data_melt.dropna(subset=['cases'])
data_cleaned

       country  year sexage  cases sex      age
15          AD  2005    m04    0.0   m      0-4
16          AD  2006    m04    0.0   m      0-4
18          AD  2008    m04    0.0   m      0-4
42          AE  2006    m04    0.0   m      0-4
43          AE  2007    m04    0.0   m      0-4
...        ...   ...    ...    ...  ..      ...
115195      VU  2008     fu    0.0   f  unknown
115269      YE  2008     fu    0.0   f  unknown
115323      ZA  2008     fu    0.0   f  unknown
115350      ZM  2008     fu    0.0   f  unknown
115379      ZW  2008     fu    0.0   f  unknown

[35750 rows x 6 columns]

6. Sort the table by country, year, age, and sex using sort_values([columns]).

In [32]:
# 6. Sort the table by country, year, age, and sex using sort_values([columns]).
data_sorted = data_cleaned.sort_values(['country', 'year', 'age', 'sex'])
data_sorted

       country  year sexage  cases sex      age
75003       AD  1996  f1524    1.0   f    15-24
17313       AD  1996  m1524    0.0   m    15-24
80772       AD  1996  f2534    1.0   f    25-34
23082       AD  1996  m2534    0.0   m    25-34
86541       AD  1996  f3544    0.0   f    35-44
...        ...   ...    ...    ...  ..      ...
55634      NaN  2008     mu    0.0   m  unknown
72941      NaN  2008   f014   73.0   f      NaN
107555     NaN  2008    f65   80.0   f      NaN
15251      NaN  2008   m014   30.0   m      NaN
49865      NaN  2008    m65  132.0   m      NaN

[35750 rows x 6 columns]

In [34]:
data_VN = data_sorted[data_sorted['country'] == 'VN']
data_VN

       country  year sexage   cases sex      age
80540       VN  1996  f1524  1127.0   f    15-24
22850       VN  1996  m1524  1994.0   m    15-24
86309       VN  1996  f2534  2606.0   f    25-34
28619       VN  1996  m2534  5716.0   m    25-34
92078       VN  1996  f3544  3045.0   f    35-44
...        ...   ...    ...     ...  ..      ...
57476       VN  2008     mu     0.0   m  unknown
74783       VN  2008   f014    48.0   f      NaN
109397      VN  2008    f65  3811.0   f      NaN
17093       VN  2008   m014    36.0   m      NaN
51707       VN  2008    m65  6667.0   m      NaN

[184 rows x 6 columns]